In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# 시리즈 만들기

In [15]:
series=pd.Series(np.arange(5), index=['a1','a2','a3','a4','a5'])
series.index.name='순서'
series

순서
a1    0
a2    1
a3    2
a4    3
a5    4
dtype: int32

# 데이터프레임 만들기

In [42]:
df=pd.DataFrame(np.random.randint(10,size=(5,3)),
             columns=['c1','c2','c3'])
df.index=[['b','b','c','c','d'],['a1','a2','a3','a4','a5']]
df.index.names=['main','a줄']
df.columns.name='c열'
df

c열       c1  c2  c3
main a줄
b    a1   0   3   6
     a2   4   3   7
c    a3   2   2   7
     a4   6   2   9
d    a5   6   3   9

In [91]:
df[['c1','c2']]

c열       c1  c2
main a줄
b    a1   0   3
     a2   4   3
c    a3   2   2
     a4   6   2
d    a5   6   3

# 데이터프레임에서 시리즈 선택하기

In [44]:
df['c1']

main  a줄
b     a1    0
      a2    4
c     a3    2
      a4    6
d     a5    6
Name: c1, dtype: int32

In [47]:
df.iloc[:,2]

main  a줄
b     a1    6
      a2    7
c     a3    7
      a4    9
d     a5    9
Name: c3, dtype: int32

In [48]:
df.iloc[:,2:3]

c열       c3
main a줄
b    a1   6
     a2   7
c    a3   7
     a4   9
d    a5   9

In [43]:
df[['c1']]

c열       c1
main a줄
b    a1   0
     a2   4
c    a3   2
     a4   6
d    a5   6

# index, values 사용하기

# 시리즈의 mean, min, max, std 메서드 사용하기

In [50]:
series.mean()
series.min()

0

# 시리즈와 불린 추출 사용하기

In [71]:
scientists = pd.read_csv('../../Downloads/pandas_data/scientists.csv')
scientists
#Age열에 대해 평균보다 큰 age만(데이터) 추출

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [57]:
scientists[scientists.Age>scientists.Age.mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

# 시리즈와 브로드캐스팅

In [ ]:
age열에 대해 모두 +10 *2 ... 연산
시리즈와 스칼라 연산

In [59]:
scientists.Age+10
scientists.Age*2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

# 열의 자료형 바꾸기와 새로운 열 추가하기

In [81]:
scientists.Age=scientists.Age.astype(str)
scientists.info()
scientists['from-to']=scientists.Born.str[:4]+'-'+scientists.Died.str[:4]
scientists

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      object
 4   Occupation  8 non-null      object
 5   from-to     8 non-null      object
dtypes: object(6)
memory usage: 512.0+ bytes

,Name,Born,Died,Age,Occupation,from-to
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-1958
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-1937
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-1910
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-1934
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-1964
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-1858
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-1954
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-1855

In [83]:
scientists.sort_values(['Age','Name'])

,Name,Born,Died,Age,Occupation,from-to
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-1958
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-1954
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-1858
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-1964
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-1937
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-1934
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-1855
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-1910

# 데이터프레임의 열 삭제하기

In [89]:
scientists.drop('Born',axis=1) #inplace=True
scientists

,Name,Born,Died,Age,Occupation,from-to
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-1958
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-1937
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-1910
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-1934
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-1964
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-1858
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-1954
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-1855